Tekla Open API Reference for Tekla Structures 2025
Position.RotationEnum Enumeration
 The position in the rotational sense.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RotationEnum
Public Enumeration RotationEnum
Members
Member name | Value | Description
FRONT | 0 |  The front option.
TOP | 1 |  The top option.
BACK | 2 |  The back option.
BELOW | 3 |  The below option.
See Also
Reference
Tekla.Structures.Model Namespace